Tekla Open API Reference for Tekla Structures 2025
PointCloud.LocationBy Property
 Gets or sets the location by value: Empty for model origin, base point guid for base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Guid LocationBy { get; set; }
Public Property LocationBy As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace